test/perf/steptest.yml
---
execution:
  - executor: locust
    concurrency: 5
    ramp-up: 80s
    hold-for: 100s
    scenario: padre-step-test

scenarios:
  padre-step-test:
    script: test/perf/steptest.py

reporting:
  - module: console

  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-xml: report.xml

  - module: blazemeter
    report-name: PerformanceTestStep
    test: PerformanceTestStep
    project: Padre

  - module: junit-xml
    filename: report/report.xml
    data-source: sample-labels